cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'railwaycat/emacsmacport'

brew 'angle-grinder'
brew 'annie'
brew 'ansifilter'
brew 'ansiweather'
brew 'aria2'
brew 'awscli'
brew 'awscli'
brew 'awslogs'
brew 'bmon'
brew 'brightness'
brew 'burl'
brew 'catimg'
brew 'coreutils'
brew 'ctags'
brew 'dos2unix'
brew 'exa'
brew 'extract_url'
brew 'fzf'
brew 'git'
brew 'git-flow-avh'
brew 'go'
brew 'htop'
brew 'hugo'
brew 'idris'
brew 'ispell'
brew 'jq'
brew 'neovim'
brew 'nvm'
brew 'pandoc'
brew 'postgresql'
brew 'rbenv'
brew 'rbenv-ctags'
brew 'rbenv-default-gems'
brew 'redis'
brew 'ripgrep'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn', args: ['without-node']
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-lovers'
cask '1password'
cask 'alfred'
cask 'amethyst'
cask 'dropbox'
cask 'dungeon-crawl-stone-soup-tiles'
cask 'fantastical'

cask 'homebrew/cask-fonts/font-iosevka'
cask 'homebrew/cask-fonts/font-source-code-pro'
cask 'homebrew/cask-versions/slack-beta'
cask 'homebrew/cask-versions/visual-studio-code-insiders'
cask 'iterm2'
cask 'karabiner-elements'
cask 'mpv'
cask 'ngrok'
cask 'railwaycat/emacsmacport/emacs-mac'

# Local Variables:
# mode: ruby
# End:
